#+title: A Piece Tree Implementation in Java

This sub module hosts three (or maybe two) data structures for Emacs texts:

- Red-black trees for Emacs text properties and buffer markers

- A piece tree for buffer texts

  #+begin_quote
  Actually, this implementation is a direct transliteration of the TypeScript
  implementation from VS Code [[https://github.com/microsoft/vscode/blob/main/src/vs/editor/common/model/pieceTreeTextBuffer/pieceTreeBase.ts][pieceTreeBase.ts]]. For more information on piece
  trees, see [[https://code.visualstudio.com/blogs/2018/03/23/text-buffer-reimplementation][the blog post from a VS Code developer]].
  #+end_quote

  Well, it was a transliteration. But we have now migrated from =java.lang.String=
  to =TruffleString= to use code point offsets instead of UTF-16 char offsets.
  By the way, the performance degraded significantly after the switch.

  Also, CR (and CR and then LF) new line handling has been removed because Emacs
  always converts them prior to inserting them into a buffer.

* On Text Properties and Markers

As for text properties (like =#("red blue" 1 3 (color red) 5 8 (color blue))=)
and buffer markers (like =(point)=) in Emacs, it should be noted that they are
in sync with the text:

#+begin_src elisp
  (with-temp-buffer
    (insert #("aa" 1 2 (color red)))   ; <red>aa</red>
    (insert #("cc" 1 2 (color blue)))  ; <red>aa</red><blue>cc</blue>
    (goto-char 3)
    (insert "bb")
    (prin1-to-string (buffer-string))) ; <red>aa</red>bb<blue>cc</blue>
#+end_src

#+RESULTS:
: #("aabbcc" 1 2 (color red) 5 6 (color blue))

Our implementation ([[file:src/main/java/party/iroiro/juicemacs/piecetree/meta/MarkPieceTreeBase.java][MarkPieceTreeBase.java]]) is simply modified from the piece
tree code, treating each interval as a "piece". (And marks are special
zero-length pieces with left/right affinity.)

